misakanetteam/MISAKANITHM/firmware/src/CY8CMBR3xxx/CY8CMBR3xxx_APIs.cpp
/*******************************************************************************
 *   Function Code
 *******************************************************************************/

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_WriteData
 ********************************************************************************
 *
 * Summary:
 *  This API writes one or more bytes of data to successive register locations
 *  in the CY8CMBR3xxx device. The initial register location is user –
 *specified.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 *writeBuffer:
 *   The buffer from which data is written to the device.
 *
 *   The first element should always contain the location of the register
 *   of the device to write to. This value can be within 0 - 134.
 *
 *   Each successive element should contain the data to be written to that
 *   register and the successive registers. These elements can have a value
 *   between 0 - 255. The number of data bytes can range from 1 to
 *   min(128, 135 - register location).
 *
 *  uint8 numberOfBytes:
 *   Number of bytes to be written, equal to the number of elements in the
 *   buffer (i.e. number of data bytes + 1).
 *   Valid range: 1 to min(129, 136 - register location)
 *
 * Return:
 *  Status
 *    Value              Description
 *    TRUE               Write was successful
 *    FALSE              Write was not successful
 *
 *******************************************************************************/
bool CY8CMBR3xxx_WriteData(uint8 slaveAddress, uint8 *writeBuffer,
                           uint8 numberOfBytes) {
  bool localStatus = FALSE; /* Default return is FALSE if anything goes wrong */

  /* Execute only if the slave address, buffer location and number of bytes are
   * valid */
  if ((CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) && (writeBuffer) &&
      ((numberOfBytes >= CY8CMBR3xxx_REG_ADDRESS_LENGTH) &&
       (numberOfBytes <= CY8CMBR3xxx_CONFIG_DATA_LENGTH_WITH_CRC_AND_ADDR))) {
    /* Write the data using the Low level host API */
    localStatus = Host_LowLevelWrite(slaveAddress, writeBuffer, numberOfBytes);
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_ReadData
 ********************************************************************************
 *
 * Summary:
 *  This API reads one or more bytes of data from successive register
 *  locations in the CY8CMBR3xxx device. The initial register location is
 *  user – specified.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 registerAddress:
 *   The register location to read from. The value passed to this argument
 *   should be one of the register offset macros defined in the file
 *   CY8CMBR3xxx_Registers.h. The macro for a register is defined only if it is
 *   supported by the device defined by CY8CMBR3xxx_DEVICE macro.
 *
 *  uint8 *readBuffer:
 *   The buffer to be updated with the data read from the device.
 *   Each successive element to contain the data read from successive
 *   registers. These elements can have a value between 0 – 255.
 *
 *  uint8 numberOfBytes:
 *   Number of data bytes to be read, equal to the number of elements
 *   in the buffer. Valid range: 1 – 252
 *
 * Return:
 *  Status
 *    Value              Description
 *    TRUE               Read was successful
 *    FALSE              Read was not successful
 *
 *******************************************************************************/
bool CY8CMBR3xxx_ReadData(uint8 slaveAddress, uint8 registerAddress,
                          uint8 *readBuffer, uint8 numberOfBytes) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* First byte in write buffer should be the register address */
  uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Execute only if the slave address, buffer location and number of bytes are
   * valid */
  if ((CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) && (readBuffer) &&
      ((numberOfBytes >= CY8CMBR3xxx_BYTE_READ_LENGTH) &&
       (numberOfBytes <= CY8CMBR3xxx_MAX_DEVICE_REGISTERS))) {
    /* Use low level host API to write the register address first */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] = registerAddress;
    if (Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                           CY8CMBR3xxx_REG_ADDRESS_LENGTH)) {
      /* Read the data using the low level host API */
      localStatus = Host_LowLevelRead(slaveAddress, readBuffer, numberOfBytes);
    }
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_WriteDualByte
 ********************************************************************************
 *
 * Summary:
 *  This API writes to a two byte register in the CY8CMBR3xxx device. The
 *  register location is user - specified.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 registerAddress:
 *   The register location to write to. The value passed to this argument
 *   should be one of the register offset macros defined in the file
 *   CY8CMBR3xxx_Registers.h. The macro for a register is defined only if it is
 *   supported by the device defined by CY8CMBR3xxx_DEVICE macro.
 *
 *  uint16 writeData:
 *   The two-byte value to be written to the register. The LSB forms the
 *   first byte written to the device, and the MSB forms the second byte.
 *   Valid range: 0 – 65535
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Write was successful
 *    FALSE                Write was not successful
 *
 *******************************************************************************/
bool CY8CMBR3xxx_WriteDualByte(uint8 slaveAddress, uint8 registerAddress,
                               uint16 writeData) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* Split the LSB of the 16-bit data */
  uint8 writeDataLSB = (writeData & CY8CMBR3xxx_BYTE_MASK);

  /* Split the MSB of the 16-bit data */
  uint8 writeDataMSB =
      ((writeData >> CY8CMBR3xxx_BYTE_SHIFT_BITS) & CY8CMBR3xxx_BYTE_MASK);

  /* Combine the data with the register address*/
  uint8 localWriteBuffer[CY8CMBR3xxx_DUAL_BYTE_WRITE_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Execute only if the slave address is valid */
  if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) {
    /* Write the data using the Low level host API */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] =
        registerAddress; /* First byte is always Register address */
    localWriteBuffer[CY8CMBR3xxx_WRITE_DATA_LSB_OFFSET] =
        writeDataLSB; /* LSB Next */
    localWriteBuffer[CY8CMBR3xxx_WRITE_DATA_MSB_OFFSET] =
        writeDataMSB; /* MSB Last */
    localStatus = Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                                     CY8CMBR3xxx_DUAL_BYTE_WRITE_LENGTH);
  }

  /* Return the status */
  return localStatus;
}

