misakanetteam/MISAKANITHM/firmware/src/CY8CMBR3xxx/CY8CMBR3xxx_APIs.cpp
/*******************************************************************************
 * Function Name: CY8CMBR3xxx_ReadDualByte
 ********************************************************************************
 *
 * Summary:
 *  This API reads from a two-byte register in the CY8CMBR3xxx device and
 *  updates the concatenated value to the read buffer. The register location
 *  is user - specified.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 registerAddress:
 *   The two-byte register to read from. The data will be read from this
 *   address and the successive address.
 *
 *   The value passed to this argument should be one of the register offset
 *   macros defined in the file CY8CMBR3xxx_Registers.h. The macro for a
 *   register is defined only if it is supported by the device defined by
 *   CY8CMBR3xxx_DEVICE macro.
 *
 *  uint16 *readData:
 *   The 2-byte buffer to be updated with the value read from the device.
 *   The API fills the LSB with the first byte read from the device, and the
 *   MSB with the second byte.
 *   The value can be between 0 – 65535.
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Read was successful
 *    FALSE                Read was not successful
 *
 *******************************************************************************/
bool CY8CMBR3xxx_ReadDualByte(uint8 slaveAddress, uint8 registerAddress,
                              uint16 *readData) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* First byte in write buffer should be the register address */
  uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* 2-byte buffer to read the dual-byte */
  uint8 localReadBuffer[CY8CMBR3xxx_DUAL_BYTE_READ_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Execute only if the slave address and buffer location are valid */
  if ((CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) && (readData)) {
    /* Use low level host API to write the register address first */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] = registerAddress;
    if (Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                           CY8CMBR3xxx_REG_ADDRESS_LENGTH)) {
      /* Read the data using the low level host API */
      if (Host_LowLevelRead(slaveAddress, localReadBuffer,
                            CY8CMBR3xxx_DUAL_BYTE_READ_LENGTH)) {
        /* Update the read buffer */
        *readData = (((uint16)localReadBuffer[CY8CMBR3xxx_READ_DATA_MSB_OFFSET]
                      << CY8CMBR3xxx_BYTE_SHIFT_BITS) |
                     (localReadBuffer[CY8CMBR3xxx_READ_DATA_LSB_OFFSET]));
        localStatus = TRUE;
      }
    }
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_SendCommand
 ********************************************************************************
 *
 * Summary:
 *  This API issues a new command to the CY8CMBR3xxx device. Before calling
 *  this API, you should check whether the device is ready to accept a new
 *  command by calling CY8CMBR3xxx_CheckCommandStatus().
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 command:
 *   The command op-code to issue. The value passed to this argument should be
 *   one of the op-code macros defined in the file
 *CY8CMBR3xxx_CommandsAndConfig.h.
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Command was issued successfully
 *    FALSE                Command was not issued successfully
 *
 *******************************************************************************/
bool CY8CMBR3xxx_SendCommand(uint8 slaveAddress, uint8 command) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* Data to be written is the command register address followed by command */
  uint8 localWriteBuffer[CY8CMBR3xxx_COMMAND_SEND_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Execute only if the slave address is valid */
  if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) {
    /* Use low level host API to send the command */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] =
        CY8CMBR3xxx_CTRL_CMD; /* First byte is the Register address */
    localWriteBuffer[CY8CMBR3xxx_COMMAND_OFFSET] =
        command; /* Command code is the second byte */
    localStatus = Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                                     CY8CMBR3xxx_COMMAND_SEND_LENGTH);
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMRB3xxx_CheckCommandStatus
 ********************************************************************************
 *
 * Summary:
 *  This API verifies whether the CY8CMBR3xxx device is ready to accept a new
 *  command, and whether the previously issued command has executed
 *successfully.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 *errorCode:
 *   Pointer to the error code returned from the last command execution.
 *   If the last command failed, the API updates this data to show what
 *   caused the failure. Valid range is 0 to 255.
 *
 *   Host should initialize this pointer to zero before calling this API.
 *   If return value is CY8CMBR3xxx_COMMAND_STATUS_FAILED after calling this API
 *   and errorCode is still zero, it means communication failure has occured.
 *
 * Return:
 *  Status
 *    Value                                       Description
 *    CY8CMBR3xxx_COMMAND_STATUS_BUSY             Last command is still
 *executing CY8CMBR3xxx_COMMAND_STATUS_SUCCESS          Last command executed
 *successfully CY8CMBR3xxx_COMMAND_STATUS_FAILED           Last command did not
 *execute successfully
 *
 *******************************************************************************/
uint8 CY8CMRB3xxx_CheckCommandStatus(uint8 slaveAddress, uint8 *errorCode) {
  uint8 localStatus =
      CY8CMBR3xxx_COMMAND_STATUS_FAILED; /* Default return is FALSE if anything
                                            goes wrong */
  uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE}; /* Data to be written is the command
                                         register address */
  uint8 localReadBuffer[CY8CMBR3xxx_COMMAND_STATUS_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE}; /* Buffer to read the Command Status and
                                         Error registers */

  /* Execute only if the slave address is valid */
  if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) {
    /* Use low level host API to write the register address first */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] = CY8CMBR3xxx_CTRL_CMD;
    if (Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                           CY8CMBR3xxx_REG_ADDRESS_LENGTH)) {
      /* Read 4-bytes (CTRL_CMD, CTRL_CMD_STATUS, RESERVED and CTRL_CMD_ERR)
       * data using the low level host API */
      if (Host_LowLevelRead(slaveAddress, localReadBuffer,
                            CY8CMBR3xxx_COMMAND_STATUS_LENGTH)) {
        /* Last command has executed if CTRL_CMD regsiter has NO_COMMAND */
        if (CY8CMBR3xxx_CMD_NO_COMMAND ==
            localReadBuffer[CY8CMBR3xxx_CMD_STAT_CTRL_CMD_OFFSET]) {
          /* CTRL_CMD_STATUS is non-zero if there was any error in executing
           * previous command */
          if (0 !=
              localReadBuffer[CY8CMBR3xxx_CMD_STAT_CTRL_CMD_STATUS_OFFSET]) {
            /* Update the error code pointer with the value from CTRL_CMD_ERR */
            *errorCode =
                localReadBuffer[CY8CMBR3xxx_CMD_STAT_CTRL_CMD_ERR_OFFSET];

            /* Let the host know that the last command failed */
            localStatus = CY8CMBR3xxx_COMMAND_STATUS_FAILED;
          } else {
            /* CTRL_CMD_STATUS is zero. Let the host know that the last command
             * was successful */
            localStatus = CY8CMBR3xxx_COMMAND_STATUS_SUCCESS;
          }
        } else {
          /* CTRL_CMD is non-zero. Let the host know that the last command is
           * still executing */
          localStatus = CY8CMBR3xxx_COMMAND_STATUS_BUSY;
        }
      }
    }
  }

  /* Return the status */
  return localStatus;
}

