misakanetteam/MISAKANITHM/firmware/src/CY8CMBR3xxx/CY8CMBR3xxx_APIs.cpp
/*******************************************************************************
 * Function Name: CY8CMBR3xxx_Configure
 ********************************************************************************
 *
 * Summary:
 *  This API writes a user – specified configuration to the CY8CMBR3xxx device,
 *  saves the configuration to flash, and resets the device. To configure the
 *  device, you should first create a configuration using EZ-Click. The
 *  128-byte configuration data (generated in the project specific .H file
 *  in the EZ-Click project) should be used directly for this API.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  const unsigned char *configuration:
 *   Buffer of 128 bytes to store the entire configuration for the device.
 *   This data should be taken directly from the EZ-Click generated
 *   configuration data. This includes 126-bytes of configuration registers
 *   data and two bytes of CRC.
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Device was configured successfully
 *    FALSE                Device was not configured successfully
 *
 *******************************************************************************/
bool CY8CMBR3xxx_Configure(uint8 slaveAddress,
                           const unsigned char *configuration) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* Buffer to write data: Maximum length is configuration data length + CRC
   * (2bytes) + Address (1byte) */
  uint8 localWriteBuffer[CY8CMBR3xxx_CONFIG_DATA_LENGTH_WITH_CRC_AND_ADDR] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Buffer to read data */
  uint8 localReadBuffer[CY8CMBR3xxx_BYTE_READ_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Buffer index variable */
  uint8 configurationIndex = CY8CMBR3xxx_DEFAULT_CONFIG_INDEX;

  /* Command error status variable */
  uint8 localCommandError = CY8CMBR3xxx_CTRL_CMD_NO_ERROR;

  /* Execute only if the device on I2C bus is a valid MBR3 device */
  if (CY8CMBR3xxx_VerifyDeviceOnBus(slaveAddress)) {
    /* Use low level host API to write the CTRL_CMD register address first */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] = CY8CMBR3xxx_CTRL_CMD;
    if (Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                           CY8CMBR3xxx_REG_ADDRESS_LENGTH)) {
      /* Use low level host API to read the CTRL_CMD register contents */
      if (Host_LowLevelRead(slaveAddress, localReadBuffer,
                            CY8CMBR3xxx_BYTE_READ_LENGTH)) {
        /* Device is busy executing previous command if CTRL_CMD is non-zero */
        if (localReadBuffer[CY8CMBR3xxx_CMD_STAT_CTRL_CMD_OFFSET] == 0) {
          /* Setup the write buffer - Register address 0x00 followed by the
           * configuration data */
          localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] =
              CY8CMBR3xxx_SENSOR_EN;
          for (configurationIndex = CY8CMBR3xxx_DEFAULT_CONFIG_INDEX;
               configurationIndex < CY8CMBR3xxx_CONFIG_DATA_LENGTH_WITH_CRC;
               configurationIndex++) {
            localWriteBuffer[configurationIndex +
                             CY8CMBR3xxx_CONFIG_DATA_WRITE_OFFSET] =
                configuration[configurationIndex];
          }

          /* Use low level host API to send the configuration data to the device
           */
          /* First register address (0x00) is appended with the configuration
           * data (128-bytes) */
          if (Host_LowLevelWrite(
                  slaveAddress, localWriteBuffer,
                  (CY8CMBR3xxx_CONFIG_DATA_LENGTH_WITH_CRC_AND_ADDR))) {
            /* Issue SAVE_CHECK_CRC command to validate the new configuration
             * data */
            if (CY8CMBR3xxx_SendCommand(slaveAddress,
                                        CY8CMBR3xxx_CMD_SAVE_CHECK_CRC)) {
              /* Wait for the SAVE_CHECK_CRC command to complete execution */
              Host_LowLevelDelay(CY8CMBR3xxx_DELAY_SAVE_CHECK_CRC_CMD);

              /* Read the device status and check for errors */
              if (CY8CMBR3xxx_COMMAND_STATUS_SUCCESS ==
                  CY8CMRB3xxx_CheckCommandStatus(slaveAddress,
                                                 &localCommandError)) {
                /* Command was successful; issue a Software Reset */
                if (CY8CMBR3xxx_SendCommand(slaveAddress,
                                            CY8CMBR3xxx_CMD_SOFTWARE_RESET)) {
                  /* Wait for the SOFTWARE_RESET command to complete execution
                   */
                  /* Wait for the device to finish reset */
                  Host_LowLevelDelay(CY8CMBR3xxx_DELAY_SOFTWARE_RESET_CMD);

                  /* Read the device status and check for errors */
                  if (CY8CMBR3xxx_COMMAND_STATUS_SUCCESS ==
                      CY8CMRB3xxx_CheckCommandStatus(slaveAddress,
                                                     &localCommandError)) {
                    /* All the above operations were OK */
                    localStatus = TRUE;
                  }
                }
              }
            }
          }
        }
      }
    }
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_VerifyDevice
 ********************************************************************************
 *
 * Summary:
 *  This API verifies that the device on the I2C bus is a valid CY8CMBR3xxx
 *  device. It checks the Device ID, Family ID, and Device Revision to
 *  verify the device.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Device is valid
 *    FALSE                Device is not valid, or I2C transaction failed
 *
 *******************************************************************************/
bool CY8CMBR3xxx_VerifyDeviceOnBus(uint8 slaveAddress) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* Data to be written is the Family_ID regsiter address */
  uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {
      CY8CMBR3xxx_FAMILY_ID};

