misakanetteam/MISAKANITHM/firmware/src/CY8CMBR3xxx/CY8CMBR3xxx_APIs.cpp
  /* Buffer to read 5-bytes */
  uint8 localReadBuffer[CY8CMBR3xxx_VERIFY_DEVICE_READ_BUFFER_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Variable to store the Family ID read from device */
  uint8 localFamilyID = CY8CMBR3xxx_DEFAULT_FAMILY_ID;

  /* Variable to store the Device ID read from device */
  uint16 localDeviceID = CY8CMBR3xxx_DEFAULT_DEVICE_ID;

  /* Variable to store the Device Revision read from device */
  uint16 localDeviceRevision = CY8CMBR3xxx_DEFAULT_DEVICE_REV;

  /* Execute only if the slave address is valid */
  if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) {
    /* Use low level host API to write the register address first */
    if (Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                           CY8CMBR3xxx_REG_ADDRESS_LENGTH)) {
      /* Use low level host API to read 5-bytes from device */
      if (Host_LowLevelRead(slaveAddress, localReadBuffer,
                            CY8CMBR3xxx_VERIFY_DEVICE_READ_BUFFER_LENGTH)) {
        /* Compile the required values from the data */
        localFamilyID =
            localReadBuffer[CY8CMBR3xxx_VERIFY_DEVICE_FAMILYID_OFFSET];
        localDeviceID =
            ((uint16)localReadBuffer[CY8CMBR3xxx_VERIFY_DEVICE_DEVID_MSB_OFFSET]
             << CY8CMBR3xxx_BYTE_SHIFT_BITS) |
            localReadBuffer[CY8CMBR3xxx_VERIFY_DEVICE_DEVID_LSB_OFFSET];

        localDeviceRevision =
            ((uint16)
                 localReadBuffer[CY8CMBR3xxx_VERIFY_DEVICE_DEVREV_MSB_OFFSET]
             << CY8CMBR3xxx_BYTE_SHIFT_BITS) |
            localReadBuffer[CY8CMBR3xxx_VERIFY_DEVICE_DEVREV_LSB_OFFSET];

        /* Compare the compiled value against the pre-defined values */
        if ((CY8CMBR3xxx_DEFAULT_FAMILY_ID == localFamilyID) &&
            (CY8CMBR3xxx_DEFAULT_DEVICE_ID == localDeviceID) &&
            (CY8CMBR3xxx_DEFAULT_DEVICE_REV == localDeviceRevision)) {
          localStatus = TRUE; /* Device is valid */
        }
      }
    }
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_SetDebugDataSensorId
 ********************************************************************************
 *
 * Summary:
 *  This API sets the Sensor ID for reading the corresponding debug data from
 *  the CY8CMBR3xxx device.
 *
 *  To read the debug data from the device, you should first call this API,
 *  followed by a time wait equal to the device refresh interval. Then you
 *  should call CY8CMBR3xxx_ReadSensorDebugData() to read back the debug data
 *  from the device.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  uint8 sensorId:
 *   The sensor number for which the data is requested. This number can be a
 *   maximum of one less than the total number of sensors supported by the
 *device.
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Sensor ID write operation was successful
 *    FALSE                Sensor ID write operation was not successful
 *
 *******************************************************************************/
bool CY8CMBR3xxx_SetDebugDataSensorId(uint8 slaveAddress, uint8 sensorId) {
  bool localStatus = FALSE; /* Default return is FALSE if anything goes wrong */
  uint8 localWriteBuffer[CY8CMBR3xxx_SENSORID_SEND_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE}; /* Data to be written is the Sensor_ID
                                         regsiter address followed by required
                                         sensor */

  /* Execute only if the slave address is valid */
  if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) {
    /* Use low level host API to write the register address first */
    localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] =
        CY8CMBR3xxx_SENSOR_ID; /* First byte is always Register address */
    localWriteBuffer[CY8CMBR3xxx_SENSORID_OFFSET] =
        sensorId; /* Second byte is the sensor id */
    localStatus = Host_LowLevelWrite(slaveAddress, localWriteBuffer,
                                     CY8CMBR3xxx_SENSORID_SEND_LENGTH);
  }

  /* Return the status */
  return localStatus;
}

/*******************************************************************************
 * Function Name: CY8CMBR3xxx_ReadSensorDebugData
 ********************************************************************************
 *
 * Summary:
 *  This API reads the Cp, Difference counts, Baseline, Raw counts, and Average
 *  Raw counts of a sensor and updates the data to a buffer.
 *
 *  To read debug data, you should first call
 *CY8CMBR3xxx_SetDebugDataSensorId(), and then wait for one refresh interval.
 *After this time, you should call this API to read the data from the device.
 *
 *  The API updates the buffer only if the sync counters of the device match.
 *  In case they don’t, the API tries to read the data again. The maximum number
 *  of read attempts is CY8CMBR3xxx_SYNC_COUNTER_MATCH_RETRY. You can set
 *  this value in CY8CMBR3xxx_APIs.h file.
 *
 * Parameters:
 *  uint8 slaveAddress:
 *   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
 *
 *  CY8CMBR3xxx_SENSORDATA *debugData:
 *   Pointer to the user-defined buffer where the data read from the CY8CMBR3xxx
 *   device is stored. The buffer structure should be as defined in
 *CY8CMBR3xxx_APIs.h.
 *
 * Return:
 *  Status
 *    Value                Description
 *    TRUE                 Buffer was updated
 *    FALSE                Buffer was not updated
 *
 *******************************************************************************/
bool CY8CMBR3xxx_ReadSensorDebugData(uint8 slaveAddress,
                                     CY8CMBR3xxx_SENSORDATA *debugData) {
  /* Default return is FALSE if anything goes wrong */
  bool localStatus = FALSE;

  /* Data to be written is the Sensor_ID regsiter address followed by required
   * sensor */
  uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

  /* Buffer to read 13-bytes */
  uint8 localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_LENGTH] = {
      CY8CMBR3xxx_BUFFER_INIT_VALUE};

